note_appV2/app/controllers/sessions_controller.rb

  def create
		@user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "mathewgutierrez00@gmail.com"], ["LIMIT", 1]]