app/controllers/notes_controller.rb

	def create

		title = params["/notes"][:title]
		body = params["/notes"][:body]

		if(title.length() == 0 && body.length() == 0)
			flash[:notice] = 'Cannot create note with no content.'
			redirect_to '/notes' and return
		end

		if(title.length() == 0)
			title = body[0..30]
		end

		newNote = {title: title, body: body, user_id: current_user[:id]}

		@note = Note.create(newNote)
---
INSERT INTO "notes" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdfasdfasdf"], ["body", "asdfasdfasdfsdfsadf"], ["created_at", "2021-04-04 21:08:09.251101"], ["updated_at", "2021-04-04 21:08:09.251101"], ["user_id", 1]]

	def update

		if(params[:update])
			title = params[:title]
			body = params[:body]

			if(title.length() == 0 && body.length() == 0)
				flash[:notice] = 'Cannot create note with no content.'
				redirect_to '/notes' and return
			end

			if(title.length() == 0)
				title = body[0..30]
			end

			@note = Note.find_by(id: params[:id])
			@note.update(title: params[:title], body: params[:body])
			@note.save

			flash[:status] = 'Note updated!'
			redirect_to '/notes' and return

		elsif(params[:delete])
			@note = Note.find_by(id: params[:id])
			@note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]
UPDATE "notes" SET "title" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["title", "Dumb Title"], ["updated_at", "2021-04-04 22:23:09.459708"], ["id", 85]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 78]]

	def destroy
		puts "destroy params: #{params}"
		@note = Note.find_by(id: params[:id])
		@note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]