app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
	def destroy
		@note = Note.find_by(params[:id])