app/controllers/notes_controller.rb

	def destroy
		@note = Note.find_by(params[:id])
		@note.destroy
---
SELECT "notes".* FROM "notes" WHERE (1) LIMIT $1  [["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]