app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "mathewgutierrez00@gmail.com"], ["LIMIT", 1]]
---
  def create
		@user = User.find_by(email: params[:email])