app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES (?, ?, ?)  [["password_digest", "$2a$12$yg.Qjb2ZlOwWXi4ouoceA.6xUqheZCLsvWn7HD4/WHrgRVA0vD416"], ["created_at", "2021-03-28 04:47:43.324278"], ["updated_at", "2021-03-28 04:47:43.324278"]]
---
  def create
		@user = User.create(params.permit(:email, :password, :name))